config.org
*** Code
#+begin_src emacs-lisp :tangle modules/utility-functions.el

(setq home-hostname-alist '("astaroth" "jarvis")
      home? (member (system-name) home-hostname-alist))

(require 'string-inflection)
(defun string-inflection-title-to-lisp-case-function (title-str)
  "Title String for Something => title-string-for-something"
  (string-inflection-kebab-case-function (s-replace-all '((" " . "-")) title-str)))

;;; Sometimes exwm fails to sets a buffer, so set it to scratch
;;; with a button press
(defun go-to-scratch ()
  (interactive)
  (message "%s" (selected-window))
  (message (format "Class: %s" exwm-class-name))
  (message (format "Instance: %s" exwm-instance-name))
  (message (format "Title: %s" exwm-title))
  (message (format "Type: %s" exwm-window-type))
  ;(message "%s" (exwm-class-name (selected-window)))
  (switch-to-buffer "*scratch*"))

(defun go-to-scratch-other ()
  (interactive)
  (switch-to-buffer-other-frame "*scratch*"))

(setq save-temp-location "~/dox/temp-save/")
(defun save-buffer-temp ()
  (interactive)
  (let* ((s (buffer-string))
         (ss (split-string s " "))
         (nl (butlast ss (- (length ss) 5)))

         )
    (set-visited-file-name (concat save-temp-location (mapconcat '(lambda (x)  (format "%s" x))  nl " ") ".org"))
    (save-buffer)
    )
  )

  (defun switchmonitor-next ()
    (interactive)
    (shell-command "xdotool mousemove_relative 1920 0"))

  (defun switchmonitor-prev ()
    (interactive)
    (shell-command "xdotool mousemove_relative -- -1920 0"))

(defmacro ifdirexists (dir &rest actions)
  "Execute functions taking dir as an argument if dir exists"
  `(when (file-exists-p ,dir)
     ((lambda (dir)
       ,@actions) ,dir)))

(provide 'utility-functions)
#+end_src
** Autocorrect
#+begin_src emacs-lisp
(load-module 'auto-correct)
#+end_src

#+begin_src emacs-lisp :tangle modules/auto-correct.el
;;; auto-correct.el -*- lexical-binding: t; -*-

(define-key ctl-x-map "\C-i"
  #'endless/ispell-word-then-abbrev)

(defun endless/simple-get-word ()
  (car-safe (save-excursion (ispell-get-word nil))))

(defun endless/ispell-word-then-abbrev (p)
  "Call `ispell-word', then create an abbrev for it.
With prefix P, create local abbrev. Otherwise it will
be global.
If there's nothing wrong with the word at point, keep
looking for a typo until the beginning of buffer. You can
skip typos you don't want to fix with `SPC', and you can
abort completely with `C-g'."
  (interactive "P")
  (let (bef aft)
    (save-excursion
      (while (if (setq bef (endless/simple-get-word))
                 ;; Word was corrected or used quit.
                 (if (ispell-word nil 'quiet)
                     nil ; End the loop.
                   ;; Also end if we reach `bob'.
                   (not (bobp)))
               ;; If there's no word at point, keep looking
               ;; until `bob'.
               (not (bobp)))
        (backward-word)
        (backward-char))
      (setq aft (endless/simple-get-word)))
    (if (and aft bef (not (equal aft bef)))
        (let ((aft (downcase aft))
              (bef (downcase bef)))
          (define-abbrev
            (if p local-abbrev-table global-abbrev-table)
            bef aft)
          (message "\"%s\" now expands to \"%s\" %sally"
                   bef aft (if p "loc" "glob")))
      (user-error "No typo at or before point"))))

(setq save-abbrevs 'silently)
(setq-default abbrev-mode t)

(setq ispell-abbrev-local nil)
(defun ispell-abbrev-advice (ispell-func &rest args)
  "Advice for `ispell-word'. Creates an abbrev for the correction made.
Unless ispell-abbrev-local, abbrev will be global.
ISPELL-FUNC passed as adviced function."
  (let ((before (downcase (or (thing-at-point 'word) "")))
        after
        (res (apply ispell-func args)))

    (setq after (downcase (or (thing-at-point 'word) "")))
    (unless (string= after before)
      (define-abbrev
        (if ispell-abbrev-local local-abbrev-table global-abbrev-table) before after))
    (message "\"%s\" now expands to \"%s\" %sally."
               before after (if ispell-abbrev-local "loc" "glob"))
    res))

(advice-add 'ispell-word :around #'ispell-abbrev-advice)

(provide 'auto-correct)
#+end_src

** Beancount
*** Requirements
#+begin_src emacs-lisp :tangle packages.el

#+end_src
