packages.el
(package! casual-avy :recipe (:host github :repo "kickingvegas/casual-avy"))
(package! yasnippet-snippets)
