packages.el
;; (package! vertico :recipe (:files (:defaults "extensions/*") ; Special recipe to load extensions conveniently
;;                              :includes (vertico-indexed
;;                                         vertico-flat
;;                                         vertico-grid
;;                                         vertico-mouse
;;                                         vertico-quick
;;                                         vertico-buffer
;;                                         vertico-repeat
;;                                         vertico-reverse
;;                                         vertico-directory
;;                                         vertico-multiform
;;                                         vertico-unobtrusive
;;                                         )))















(package! org-roam)
(package! org-roam-ui)
