config.org
**** Add text to any org headline
#+begin_src emacs-lisp :tangle modules/org-functions.el
(require 'counsel)
(require 's)

(defun org-get-headline-path (prompt)
  "Select a headline in any open org file and return marker to it."
  (let (entries)
    (dolist (b (buffer-list))
      (with-current-buffer b
        (when (derived-mode-p 'org-mode)
          (setq entries
                (nconc entries
                       (counsel-outline-candidates
                        (cdr (assq 'org-mode counsel-outline-settings))
                        (counsel-org-goto-all--outline-path-prefix)))))))
    (let*
        ((sel
          (completing-read prompt entries nil t nil
                           'counsel-org-goto-history
                           ))
         (split (s-split-up-to " " sel 1))
         (filename (car split))
         (path (apply 's-split "/" (cdr split)))
         )
      (org-find-olp `(,filename ,@path))
      )))

(defun org-goto-headline ()
  "Go to any open org headline."
  (interactive)
  (org-goto-marker-or-bmk (org-get-headline-path "Goto: ")))


(defun org-insert-under-headline ()
  "Insert yanked text as last line under selected org headline."
  (interactive)
  (save-window-excursion
    (org-goto-marker-or-bmk
     (org-get-headline-path "Insert under: "))
    (outline-next-heading)
    (counsel-yank-pop)
    (newline)))

(defun org-config-new-block ()
  "Create a new code block belonging to specific module."
  (interactive)
  (let ((current-headline
         (string-inflection-title-to-lisp-case-function (nth 4 (org-heading-components)))))
    (insert (concat "*** Description\n#+begin_src emacs-lisp :tangle modules/" current-headline ".el\n\n#+end_src")))
  (evil-previous-visual-line))

(provide 'org-functions)
#+end_src
*** Org Citations
#+begin_src emacs-lisp
(load-module 'org-citations)
#+end_src
**** Requirements
#+begin_src emacs-lisp :tangle packages.el
;(package! citar-capf :recipe (:host github :repo "mclear-tools/citar-capf"))
(package! zotra)
#+end_src
**** Code
#+begin_src emacs-lisp :tangle modules/org-citations.el
(use-package! citar-embark
  :after citar embark
  :config (citar-embark-mode))

(use-package! citar
  :custom
  (org-cite-insert-processor 'citar)
  (org-cite-follow-processor 'citar)
  (org-cite-activate-processor 'citar)
  )

(after! citar
(setq citar-templates
      '((main . "${author editor:30}     ${date year issued:4}     ${title:80}")
        (suffix . "          ${=key= id:15}    ${=type=:10}    ${tags keywords:*}")
        (preview . "${author editor} (${year issued date}) ${title}, ${journal journaltitle publisher container-title collection-title}.\n")
        (note . "Notes on ${author editor}, ${title}")))

(setq citar-symbols
      `((file ,(all-the-icons-faicon "file-o" :face 'all-the-icons-green :v-adjust -0.1) . " ")
        (note ,(all-the-icons-material "speaker_notes" :face 'all-the-icons-blue :v-adjust -0.3) . " ")
        (link ,(all-the-icons-octicon "link" :face 'all-the-icons-orange :v-adjust 0.01) . " "))))

(setq citar-symbol-separator " ")

(defun ex/search-pdf-contents (keys-entries &optional str)
  "Search pdfs."
  (interactive (list (citar-select-refs)))
  (let ((files (hash-table-to-value-list
                (citar-get-files
                 keys-entries)))
        (search-str (or str (read-string "Search string: "))))
    (pdf-occur-search files search-str t)))

(defun hash-table-to-value-list (hashtable)
  "Convert a hash table to a list of values"
  (let ((vlist '()))
    (maphash '(lambda (key value) (push value vlist)) hashtable)
    (flatten-list vlist)))

;; with this, you can exploit embark's multitarget actions, so that you can run `embark-act-all`
(after! embark
  (add-to-list 'embark-multitarget-actions #'ex/search-pdf-contents))

(setq zotra-cli-command '("node" "/home/user/dox/install/zotra-cli/index.js"))

(provide 'org-citations)
#+end_src
*** Org Links
#+begin_src emacs-lisp
(load-module 'org-links)
#+end_src
**** Requirements
#+begin_src emacs-lisp :tangle packages.el

#+end_src
**** Code
#+begin_src emacs-lisp :tangle modules/org-links.el
;;; ol-man.el - Support for links to man pages in Org mode
(require 'ol)

(org-link-set-parameters "b"
                         :follow #'org-b-open
                         :export #'org-b-export
                         :store #'org-b-store-link)

(defun org-b-open (verse _)
  "Visit the verse."
  (funcall org-b-command path))

(defun org-b-store-link ()
  "Store a link to a man page."
  (when (memq major-mode '(Man-mode woman-mode))
    ;; This is a man page, we do make this link.
    (let* ((page (org-man-get-page-name))
           (link (concat "b:" page))
           (description (format "B page for %s" page)))
      (org-link-store-props
       :type "b"
       :link link
       :description description))))

(defun org-man-get-page-name ()
  "Extract the page name from the buffer name."
  ;; This works for both `Man-mode' and `woman-mode'.
  (if (string-match " \\(\\S-+\\)\\*" (buffer-name))

    (error "Cannot create link to this man page")))

(defun org-b-export (link description format _)
  "Export a man page link from Org files."
  (let ((path (format "http://man.he.net/?topic=%s&section=all" link))
        (desc (or description link)))
    (pcase format
      (`html (format "<a target=\"_blank\" href=\"%s\">%s</a>" path desc))
      (`latex (format "\\href{%s}{%s}" path desc))
      (`texinfo (format "@uref{%s,%s}" path desc))
      (`ascii (format "%s (%s)" desc path))
      (t path))))

(provide 'org-links)
#+end_src

*** Org Capture
#+begin_src emacs-lisp
(load-module 'org-capture-tweaks)
#+end_src
**** Requirements
#+begin_src emacs-lisp :tangle packages.el

#+end_src
**** Code
#+begin_src emacs-lisp :tangle modules/org-capture-tweaks.el
(setq +org-capture-todo-file "/home/user/sync/agenda/todo.org"
      +org-capture-notes-file "/home/user/sync/agenda/notes.org"
      +org-capture-journal-file "/home/user/sync/agenda/journal.org")

; Handled by Doom Emacs
  ;; (add-to-list 'org-capture-templates
  ;;              '("Ö" "Todo" entry ; key, name, type
  ;;                (file+olp+datetree +org-capture-todo-file) ; target
  ;;                "* TODO %^{Title}\n%T %?"
  ;;                :prepend t ; properties
  ;;                :kill-buffer t))

  ;; (add-to-list 'org-capture-templates
  ;;              '("Ä" "Note" entry ; key, name, type
  ;;                (file+olp+datetree +org-capture-notes-file) ; target
  ;;                "* %^{Title} %^G\n%T %?"
  ;;                :prepend t ; properties
  ;;                :kill-buffer t))


(provide 'org-capture-tweaks)
#+end_src
** Org Appear
*** Requirements
#+begin_src emacs-lisp :tangle packages.el
(package! org-appear :recipe (:host github :repo "awth13/org-appear"))
#+end_src
*** Code
#+begin_src emacs-lisp :tangle modules/org-tweaks.el
(add-hook 'org-mode-hook 'org-appear-mode)
#+end_src
** Languages
#+begin_src emacs-lisp
(load-module 'languages)
#+end_src
*** Requirements
#+begin_src emacs-lisp :tangle packages.el

#+end_src
*** Code
#+begin_src emacs-lisp :tangle modules/languages.el
;;; languages.el -*- lexical-binding: t; -*-

;; CANoe/CAPL
(define-derived-mode capl-mode
  c-mode "CAPL"
  "Major mode for CANoe/CAPL."
  (flycheck-mode 0))

;; Rust
(setq rustic-format-trigger 'on-save
      rustic-format-on-save t)

;; Latin
;;

;;;###autoload
(define-minor-mode latin-minor-mode
  "Minor mode for writing Church Latin"
  :lighter " ☧"
  :global t)

(defun latin-minor-mode--insert-ae ()
  "Replace ae with æ"
  (interactive)
  (if (bound-and-true-p latin-minor-mode)
  (if (eq (char-before) ?a)
      (progn
        (backward-delete-char 1)
        (insert "æ"))
    (if (eq (char-before) ?A)
        (progn
          (backward-delete-char 1)
          (insert "Æ")
          )
      (insert "e")))
  (self-insert-command 1)))

(defun latin-minor-mode--insert-versicle ()
  "Replace VV with ℣"
  (interactive)
  (if (bound-and-true-p latin-minor-mode)
  (if (eq (char-before) ?V)
      (progn
        (backward-delete-char 1)
        (insert "℣"))
      (insert "V"))
  (self-insert-command 1)))

(defun latin-minor-mode--insert-response ()
  "Replace RR with ℟"
  (interactive)
  (if (bound-and-true-p latin-minor-mode)
  (if (eq (char-before) ?R)
      (progn
        (backward-delete-char 1)
        (insert "℟"))
      (insert "R"))
  (self-insert-command 1)))



(map! :map latin-minor-mode-map
      :n "e" #'latin-minor-mode--insert-ae
      :n "R" #'latin-minor-mode--insert-response
      :n "V" #'latin-minor-mode--insert-versicle)

;; For some reason, that doesn't work...
;;(progn
;;  (global-set-key (kbd "e") 'latin-minor-mode--insert-ae)
;;  (global-set-key (kbd "R") 'latin-minor-mode--insert-response)
;;  (global-set-key (kbd "V") 'latin-minor-mode--insert-versicle))
(provide 'languages)
#+end_src

** Human languages
*** Language Baybayin
#+begin_src emacs-lisp
(load-module 'language-baybayin)
#+end_src
**** Requirements
#+begin_src emacs-lisp :tangle packages.el

#+end_src
