packages.el



;(package! citar-capf :recipe (:host github :repo "mclear-tools/citar-capf"))
(package! zotra)





(package! org-appear :recipe (:host github :repo "awth13/org-appear"))















(package! org-noter)
