config.org
**** Code
#+begin_src emacs-lisp :tangle modules/language-baybayin.el
(quail-define-package
 "baybayin" "UTF-8" "ᜊ" t
 "Baybayin input method."
 nil t nil nil nil nil nil nil nil nil t)

(quail-define-rules
 ("a" ["ᜀ"])
 ("b" ["ᜊ᜔"])
 ("ba" ["ᜊ"])
 ("be" ["ᜊᜒ"])
 ("bi" ["ᜊᜒ"])
 ("bu" ["ᜊᜓ"])
 ("bo" ["ᜊᜓ"])
 ("c" ["ᜃ᜔"])
 ("ca" ["ᜃ"])
 ("ce" ["ᜃᜒ"])
 ("ci" ["ᜃᜒ"])
 ("cu" ["ᜃᜓ"])
 ("co" ["ᜃᜓ"])
 ("d" ["ᜇ᜔"])
 ("da" ["ᜇ"])
 ("de" ["ᜇᜒ"])
 ("di" ["ᜇᜒ"])
 ("du" ["ᜇᜓ"])
 ("do" ["ᜇᜓ"])
 ("e" ["ᜁ"])
 ("f" ["ᜉ᜔"])
 ("fa" ["ᜉ"])
 ("fe" ["ᜉᜒ"])
 ("fi" ["ᜉᜒ"])
 ("fu" ["ᜉᜓ"])
 ("fo" ["ᜉᜓ"])
 ("g" ["ᜄ᜔"])
 ("ga" ["ᜄ"])
 ("ge" ["ᜄᜒ"])
 ("gi" ["ᜄᜒ"])
 ("gu" ["ᜄᜓ"])
 ("go" ["ᜄᜓ"])
 ("h" ["ᜑ᜔"])
 ("ha" ["ᜑ"])
 ("he" ["ᜑᜒ"])
 ("hi" ["ᜑᜒ"])
 ("hu" ["ᜑᜓ"])
 ("ho" ["ᜑᜓ"])
 ("i" ["ᜁ"])
 ("j" ["ᜐ᜔"])
 ("ja" ["ᜐ"])
 ("je" ["ᜐᜒ"])
 ("ji" ["ᜐᜒ"])
 ("ju" ["ᜐᜓ"])
 ("jo" ["ᜐᜓ"])
 ("k" ["ᜃ᜔"])
 ("ka" ["ᜃ"])
 ("ke" ["ᜃᜒ"])
 ("ki" ["ᜃᜒ"])
 ("ku" ["ᜃᜓ"])
 ("ko" ["ᜃᜓ"])
 ("l" ["ᜎ᜔"])
 ("la" ["ᜎ"])
 ("le" ["ᜎᜒ"])
 ("li" ["ᜎᜒ"])
 ("lu" ["ᜎᜓ"])
 ("lo" ["ᜎᜓ"])
 ("m" ["ᜋ᜔"])
 ("ma" ["ᜋ"])
 ("me" ["ᜋᜒ"])
 ("mi" ["ᜋᜒ"])
 ("mu" ["ᜋᜓ"])
 ("mo" ["ᜋᜓ"])
 ("n" ["ᜈ᜔"])
 ("na" ["ᜈ"])
 ("ne" ["ᜈᜒ"])
 ("ni" ["ᜈᜒ"])
 ("nu" ["ᜈᜓ"])
 ("no" ["ᜈᜓ"])
 ("ng" ["ᜅ᜔"])
 ("nga" ["ᜅ"])
 ("nge" ["ᜅᜒ"])
 ("ngi" ["ᜅᜒ"])
 ("ngu" ["ᜅᜓ"])
 ("ngo" ["ᜅᜓ"])
 ("o" ["ᜂ"])
 ("p" ["ᜉ᜔"])
 ("pa" ["ᜉ"])
 ("pe" ["ᜉᜒ"])
 ("pi" ["ᜉᜒ"])
 ("pu" ["ᜉᜓ"])
 ("po" ["ᜉᜓ"])
 ("q" ["ᜃ᜔"])
 ("qa" ["ᜃ"])
 ("qe" ["ᜃᜒ"])
 ("qi" ["ᜃᜒ"])
 ("qu" ["ᜃᜓ"])
 ("qo" ["ᜃᜓ"])
 ;; ("r" ["ᜇ᜔"])
 ;; ("ra" ["ᜇ"])
 ;; ("re" ["ᜇᜒ"])
 ;; ("ri" ["ᜇᜒ"])
 ;; ("ru" ["ᜇᜓ"])
 ;; ("ro" ["ᜇᜓ"])
 ("r" ["ᜍ᜔"])
 ("ra" ["ᜍ"])
 ("re" ["ᜍᜒ"])
 ("ri" ["ᜍᜒ"])
 ("ru" ["ᜍᜓ"])
 ("ro" ["ᜍᜓ"])
 ("s" ["ᜐ᜔"])
 ("sa" ["ᜐ"])
 ("se" ["ᜐᜒ"])
 ("si" ["ᜐᜒ"])
 ("su" ["ᜐᜓ"])
 ("so" ["ᜐᜓ"])
 ("t" ["ᜆ᜔"])
 ("ta" ["ᜆ"])
 ("te" ["ᜆᜒ"])
 ("ti" ["ᜆᜒ"])
 ("tu" ["ᜆᜓ"])
 ("to" ["ᜆᜓ"])
 ("u" ["ᜂ"])
 ("v" ["ᜊ᜔"])
 ("va" ["ᜊ"])
 ("ve" ["ᜊᜒ"])
 ("vi" ["ᜊᜒ"])
 ("vu" ["ᜊᜓ"])
 ("vo" ["ᜊᜓ"])
 ("w" ["ᜏ᜔"])
 ("wa" ["ᜏ"])
 ("we" ["ᜏᜒ"])
 ("wi" ["ᜏᜒ"])
 ("wu" ["ᜏᜓ"])
 ("wo" ["ᜏᜓ"])
 ("x" ["ᜋ᜔"])
 ("xa" ["ᜋ"])
 ("xe" ["ᜋᜒ"])
 ("xi" ["ᜋᜒ"])
 ("xu" ["ᜋᜓ"])
 ("xo" ["ᜋᜓ"])
 ("y" ["ᜌ᜔"])
 ("ya" ["ᜌ"])
 ("ye" ["ᜌᜒ"])
 ("yi" ["ᜌᜒ"])
 ("yu" ["ᜌᜓ"])
 ("yo" ["ᜌᜓ"])
 ("z" ["ᜎ᜔"])
 ("za" ["ᜎ"])
 ("ze" ["ᜎᜒ"])
 ("zi" ["ᜎᜒ"])
 ("zu" ["ᜎᜓ"])
 ("zo" ["ᜎᜓ"])
 ("," ["᜵"])
 ("." ["᜶"]))

(defvar tagalog-font-doctrina nil "Whether Doctrina 1593 Tagalog font is used")

(defun toggle-tagalog-font-doctrina ()
  "Set Tagalog font to Doctrina 1593"
  (interactive)
  (setq tagalog-font-doctrina (not tagalog-font-doctrina))
  (if tagalog-font-doctrina
    (set-fontset-font "fontset-default" 'tagalog (font-spec :family "Tagalog Doctrina 1593"))
    (set-fontset-font "fontset-default" 'tagalog (font-spec :family "Noto Sans Tagalog"))))

(set-fontset-font "fontset-default" 'tagalog (font-spec :family "Noto Sans Tagalog"))
;; ᜀ is for some reason not in Source Code Pro Semibold
;; (set-fontset-font "fontset-default" '(#x1700 . #x1700) (font-spec :family "Tagalog Doctrina 159"))

(provide 'language-baybayin)
#+end_src
*** Language Arabic
#+begin_src emacs-lisp
(load-module 'language-arabic)
#+end_src
**** Requirements
#+begin_src emacs-lisp :tangle packages.el

#+end_src
**** Code
#+begin_src emacs-lisp :tangle modules/language-arabic.el
(quail-define-package
 "phonetic arabic" "UTF-8" "س" t
 "Phonetic input method."
 nil t nil nil nil nil nil nil nil nil t)

(quail-define-rules
 ("0" ["٠"])
 ("1" ["١"])
 ("2" ["٢"])
 ("3" ["٣"])
 ("4" ["٤"])
 ("5" ["٥"])
 ("6" ["٦"])
 ("7" ["٧"])
 ("8" ["٨"])
 ("9" ["٩"])
 ("ah" ["ء"])
 ("aa" ["ا"])
 ("aaa" ["آ"])
 ("ae" ["أ"])
 ("ai" ["إ"])
 ("ao" ["ؤ"])
 ("au" ["ئ"])
 ("b" ["ب"])
 ("t" ["ت"])
 ("th" ["ث"])
 ("j" ["ج"])
 ("H" ["ح"])
 ("kh" ["خ"])
 ("d" ["د"])
 ("dh" ["ذ"])
 ("r" ["ر"])
 ("z" ["ز"])
 ("s" ["س"])
 ("sh" ["ش"])
 ("S" ["ص"])
 ("D" ["ض"])
 ("T" ["ط"])
 ("Z" ["ظ"])
 ("E" ["ع"])
 ("gh" ["غ"])
 ("f" ["ف"])
 ("q" ["ق"])
 ("k" ["ك"])
 ("l" ["ل"])
 ("m" ["م"])
 ("n" ["ن"])
 ("h" ["ه"])
 ("w" ["و"])
 ("y" ["ي"])
 ("p" ["پ"])
 ("v" ["ڤ"])
 ("g" ["گ"])
 ("ch" ["چ"])
 ("zh" ["ژ"])
 ("a" ["َ"])
 ("i" ["ِ"])
 ("u" ["ُ"])
 ("n" ["ً"])
 ("e" ["ٍ"])
 ("o" ["ٌ"])
 )
(provide 'language-arabic)
#+end_src
** Email
#+begin_src emacs-lisp
(load-module-if 'mu4e 'email)
#+end_src
*** Requirements
#+begin_src emacs-lisp :tangle packages.el

#+end_src
*** Code
#+begin_src emacs-lisp :tangle modules/email.el
;;; email.el -*- lexical-binding: t; -*-

(setq mu4e-mu-binary "/bin/mu")

;;; mu4e reindexing when tmp file exists
(after! mu4e
  (defvar mu4e-reindex-request-file "/tmp/mu_reindex_now"
    "Location of the reindex request, signaled by existance")
  (defvar mu4e-reindex-request-min-seperation 5.0
    "Don't refresh again until this many second have elapsed.
Prevents a series of redisplays from being called (when set to an appropriate value)")

  (defvar mu4e-reindex-request--file-watcher nil)
  (defvar mu4e-reindex-request--file-just-deleted nil)
  (defvar mu4e-reindex-request--last-time 0)

  (defun mu4e-reindex-request--add-watcher ()
    (setq mu4e-reindex-request--file-just-deleted nil)
    (setq mu4e-reindex-request--file-watcher
          (file-notify-add-watch mu4e-reindex-request-file
                                 '(change)
                                 #'mu4e-file-reindex-request)))

  (defadvice! mu4e-stop-watching-for-reindex-request ()
    :after #'mu4e~proc-kill
    (if mu4e-reindex-request--file-watcher
        (file-notify-rm-watch mu4e-reindex-request--file-watcher)))

  (defadvice! mu4e-watch-for-reindex-request ()
    :after #'mu4e~proc-start
    (mu4e-stop-watching-for-reindex-request)
    (when (file-exists-p mu4e-reindex-request-file)
      (delete-file mu4e-reindex-request-file))
    (mu4e-reindex-request--add-watcher))

  (defun mu4e-file-reindex-request (event)
    "Act based on the existance of `mu4e-reindex-request-file'"
    (if mu4e-reindex-request--file-just-deleted
        (mu4e-reindex-request--add-watcher)
      (when (equal (nth 1 event) 'created)
        (delete-file mu4e-reindex-request-file)
        (setq mu4e-reindex-request--file-just-deleted t)
        (mu4e-reindex-maybe t))))

  (defun mu4e-reindex-maybe (&optional new-request)
    "Run `mu4e~proc-index' if it's been more than
`mu4e-reindex-request-min-seperation'seconds since the last request,"
    (let ((time-since-last-request (- (float-time)
                                      mu4e-reindex-request--last-time)))
      (when new-request
        (setq mu4e-reindex-request--last-time (float-time)))
      (if (> time-since-last-request mu4e-reindex-request-min-seperation)
          (mu4e~proc-index nil t)
        (when new-request
          (run-at-time (* 1.1 mu4e-reindex-request-min-seperation) nil
                       #'mu4e-reindex-maybe))))))

(setq mu4e-notification-support t)
(after! mu4e-alert
  (mu4e-alert-enable-notifications)
  (mu4e-alert-set-default-style 'libnotify)
  (setq +mu4e-alert-bell-cmd '("mail-alert.sh"))
  (mu4e-update-mail-and-index 1)) ; fetch emails in background)
(provide 'email)
#+end_src
**** mail-alert.sh
#+begin_src shell :tangle ~/.scripts/mail-alert.sh
#!/bin/env sh

#paplay "/usr/share/sounds/freedesktop/stereo/message.oga"

mu_find_cmd() {
    mu find --sortfield=date --reverse --maxnum=1 --fields \"$1\" flag:unread | tr -d '"'
}

SENDER=$(mu_find_cmd "f")
SUBJECT=$(mu_find_cmd "s")

dunstify -h string:x-dunst-stack-tag:email -i "/home/user/dox/icons/mail-unread-symbolic.svg" "$SENDER" "$SUBJECT"
#+end_src
*** Email Config
#+begin_src emacs-lisp
(load-module-if 'mu4e 'email-config)
#+end_src
**** Requirements
#+begin_src emacs-lisp :tangle packages.el

#+end_src
