config.org
**** Code
#+begin_src emacs-lisp :tangle modules/email-config.el
;;; email-config.el -*- lexical-binding: t; -*-

(require 'mu4e)
(require 'smtpmail)
(define-key mu4e-view-mode-map (kbd "f") 'mu4e-view-go-to-url)

(setq mu4e-root-maildir "~/mail"
      ;mu4e-get-mail-command "offlineimap -q -f INBOX"
      mu4e-get-mail-command "mbsync -a || true"
      mu4e-update-interval 300 ;; second
      mu4e-compose-signature-auto-include nil
      mu4e-view-show-images t
      mu4e-view-prefer-html t
      mu4e-html2text-command "iconv -c -t utf-8 | pandoc -f html -t plain"
      mu4e-headers-auto-update t
      mu4e-compose-format-flowed t
      sendmail-program "/usr/bin/msmtp"
      smtpmail-stream-type 'starttls
      message-sendmail-f-is-evil t
      message-sendmail-extra-arguments '("--read-envelope-from")
;      message-send-mail-function 'smtpmail-send-it
      message-send-mail-function 'message-send-mail-with-sendmail
      mu4e-view-show-addresses t
      mu4e-split-view 'single-window ;; horizontal (default), vertical
      mu4e-attachment-dir "~/Downloads"
      smtpmail-queue-mail nil
      smtpmail-queue-dir "~/mail/queue/cur"
      mu4e-compose-in-new-frame nil
      mu4e-compose-dont-reply-to-self t
      mu4e-headers-date-format "%Y-%m-%d %H:%M"
      message-kill-buffer-on-exit nil
      mu4e-confirm-quit nil
      mu4e-context-policy 'ask-if-none
      mu4e-compose-context-policy 'always-ask
      mu4e-headers-results-limit 500
      mu4e-use-fancy-chars t)

(defun mu4e--view-quit-and-back ()
  "Quit mu4e view buffer and go back to mu4e"
  (interactive)
  (mu4e-view-quit)
  (mu4e--goto-inbox))

(defun mu4e--goto-inbox ()
  "Goto mu4e inbox"
  (interactive)
  (mu4e~headers-jump-to-maildir "/gmail/INBOX"))

(map! :map mu4e-view-mode-map
      :after mu4e-view
      :n "<backspace>" 'mu4e--view-quit-and-back)

(global-set-key (kbd "s-m") 'mu4e--goto-inbox)

(when (fboundp 'imagemagick-register-types)
  (imagemagick-register-types))

; Make sure doom doesn't move mu4e article buffer into popup
; Show it in same window
(after! mu4e
  (set-popup-rule! "*mu4e-article*" :ignore 1))

;(require 'org-mu4e)
;(setq org-mu4e-convert-to-html t
;org-mu4e-link-query-in-headers-mode nil)

(require 'org-mime)

;; this seems to fix the babel file saving thing
(defun org~mu4e-mime-replace-images (str current-file)
"Replace images in html files with cid links."
(let (html-images)
(cons
(replace-regexp-in-string ;; replace images in html
"src=\"\\([^\"]+\\)\""
(lambda (text)
(format
        "src=\"./:%s\""
        (let* ((url (and (string-match "src=\"\\([^\"]+\\)\"" text)
                        (match-string 1 text)))
        (path (expand-file-name
                url (file-name-directory current-file)))
        (ext (file-name-extension path))
        (id (replace-regexp-in-string "[\/\\\\]" "_" path)))
        (add-to-list 'html-images
                (org~mu4e-mime-file
                (concat "image/" ext) path id))
        id)))
str)
html-images)))

(add-to-list 'mu4e-view-actions
'("ViewInBrowser" . mu4e-action-view-in-browser) t)

; Ignore popup rules to make sure emails are shown in same window
(after! mu4e
  (set-popup-rule! "^\\*mu4e-headers\\*" :ignore t)
  (set-popup-rule! "^\\*mu4e-view\\*" :ignore t))


(provide 'email-config)
#+end_src

*** Email Accounts
#+begin_src emacs-lisp
(load-module-if 'mu4e 'email-accounts)
#+end_src
**** Requirements
#+begin_src emacs-lisp :tangle packages.el

#+end_src
**** Code
#+begin_src emacs-lisp :tangle modules/email-accounts.el
;; Email Accounts
(require 'email-refile)
(require 'smtpmail)
(setq +mu4e-gmail-accounts '(("e.p.mysliwietz@gmail.com" . "/gmail"))
      mu4e-contexts
      `(
       ,(make-mu4e-context
	  :name "gmail"
	  :enter-func (lambda () (mu4e-message "Switching to gmail context"))
	  :leave-func (lambda () (mu4e-message "Leaving gmail context"))
	  :vars '(
		  ( user-full-name	             . "Egidius Mysliwietz" )
		  ( user-mail-address	         . "e.p.mysliwietz@gmail.com" )
		  ( mu4e-drafts-folder           . "/gmail/[Gmail]/Entw&APw-rfe" )
                  ( mu4e-sent-folder             . "/gmail/[Gmail]/Gesendet" )
		  ( mu4e-trash-folder            . "/gmail/[Gmail]/Papierkorb" )
		  ( mu4e-refile-folder           . gmail-refile )
		  ))
        ,(make-mu4e-context
	  :name "emysliwietz"
	  :enter-func (lambda () (mu4e-message "Switching to emysliwietz context"))
          :leave-func (lambda () (mu4e-message "Leaving emysliwietz context"))
	  ;; we match based on the contact-fields of the message
	  :vars '(
		  ( user-full-name               . "Egidius Mysliwietz" )
		  ( user-mail-address	         . "egidius@mysliwietz.de"  )
		  ( mu4e-archive-folder          . "/emysliwietz/Archive" )
		  ( mu4e-drafts-folder           . "/emysliwietz/Drafts" )
                  ( mu4e-sent-folder             . "/emysliwietz/Sent" )
		  ( mu4e-trash-folder            . "/emysliwietz/Trash" )
		  ( mu4e-refile-folder           . gmail-refile )
		  ))
      ;,(make-mu4e-context
	  ;:name "xgmx"
	  ;:enter-func (lambda () (mu4e-message "Switching to gmx context"))
	  ;:leave-func (lambda () (mu4e-message "Leaving gmx context"))
	  ;:vars '(
		  ;( user-full-name	         . "Egidius Mysliwietz" )
		  ;( user-mail-address	         . "egidius.mysliwietz@gmx.de" )
                  ;( smtpmail-mail-address        . "egidius.mysliwietz@gmx.de")
		  ;( smtpmail-smtp-user           . "egidius.mysliwietz@gmx.de")
		  ;( mu4e-archive-folder          . "/gmx/Archiv" )
		  ;( mu4e-drafts-folder           . "/gmx/Entwürfe" )
                  ;( mu4e-sent-folder             . "/gmx/Gesendet" )
		  ;( mu4e-trash-folder            . "/gmx/Gelöscht" )
                  ;( smtpmail-default-smtp-server . "mail.gmx.net" )
                  ;( smtpmail-smtp-server         . "mail.gmx.net" )
		  ;( smtpmail-local-domain        . "gmx.net" )
                  ;( smtpmail-smtp-service        . 465 )
		  ;))
       ,(make-mu4e-context
	  :name "ru"
	  :enter-func (lambda () (mu4e-message "Switch to ru context"))
	  :leave-func (lambda () (mu4e-message "Leaving ru context"))
	  :vars '(
		  ( user-full-name	             . "Egidius Mysliwietz" )
		  ( user-mail-address	         . "egidius.mysliwietz@ru.nl" )
		  ( mu4e-drafts-folder           . "/ru/Drafts" )
                  ( mu4e-sent-folder             . "/ru/Sent Items" )
		  ( mu4e-trash-folder            . "/ru/Deleted Items" )
          		  ( mu4e-archive-folder          . "/ru/Archive" )
		  ))
       ;,(make-mu4e-context
	  ;:name "eindhoven"
	  ;:enter-func (lambda () (mu4e-message "Switch to eindhoven context"))
	  ;:leave-func (lambda () (mu4e-message "Leaving eindhoven context"))
	  ;:vars '(
		  ;( user-full-name	         . "Egidius Mysliwietz" )
		  ;( user-mail-address	         . "e.p.j.mysliwietz@student.tue.nl" )
                  ;( smtpmail-mail-address        . "e.p.j.mysliwietz@student.tue.nl")
		  ;( smtpmail-smtp-user           . "e.p.j.mysliwietz@student.tue.nl")
                  ;( mu4e-archive-folder          . "/eindhoven/Archive" )
		  ;( mu4e-drafts-folder           . "/eindhoven/Drafts" )
                  ;( mu4e-sent-folder             . "/eindhoven/Sent Items" )
		  ;( mu4e-trash-folder            . "/eindhoven/Trash" )
                  ;( smtpmail-default-smtp-server . "smtp.office365.com" )
                  ;( smtpmail-smtp-server         . "smtp.office365.com" )
		  ;( smtpmail-local-domain        . "office365.com" )
                  ;( smtpmail-smtp-service        . 587 )
		  ;))
       ;,(make-mu4e-context
	  ;:name "ntu"
	  ;:enter-func (lambda () (mu4e-message "Switch to ntu context"))
	  ;:leave-func (lambda () (mu4e-message "Leaving ntu context"))
	  ;:vars '(
		  ;( user-full-name	         . "Egidius Mysliwietz" )
		  ;( user-mail-address	         . "n1903483e@e.ntu.edu.sg" )
                  ;( smtpmail-mail-address        . "n1903483e@e.ntu.edu.sg")
		  ;( smtpmail-smtp-user           . "n1903483e@e.ntu.edu.sg")
                  ;( mu4e-archive-folder          . "/ntu/Archive" )
		  ;( mu4e-drafts-folder           . "/ntu/Drafts" )
                  ;( mu4e-sent-folder             . "/ntu/Sent Items" )
		  ;( mu4e-trash-folder            . "/ntu/Trash" )
                  ;( smtpmail-default-smtp-server . "smtp.office365.com" )
                  ;( smtpmail-smtp-server         . "smtp.office365.com" )
		  ;( smtpmail-local-domain        . "office365.com" )
                  ;( smtpmail-smtp-service        . 587 )
		  ;))
       ))

(provide 'email-accounts)
#+end_src

*** mbsync config
**** RU
#+begin_src shell :tangle ~/.mbsyncrc

IMAPAccount ru
Host smtp.office365.com
User egidius.mysliwietz@ru.nl
PassCmd "secret-tool lookup mail-mbsync ru"
Port 993
SSLType IMAPS
AuthMechs XOAUTH2
CertificateFile /etc/ssl/certs/ca-certificates.crt

IMAPStore ru-remote
Account ru

MaildirStore ru-local
Path ~/mail/ru/
Inbox ~/mail/ru/INBOX
Subfolders Verbatim

Channel ru
Far :ru-remote:
Near :ru-local:
Create Both
Expunge Both
Sync All
Patterns *
SyncState *

# ###########################################
#+end_src
**** Strato
#+begin_src shell :tangle ~/.mbsyncrc
###########################################

IMAPAccount emysliwietz
Host imap.strato.de
User egidius@mysliwietz.de
PassCmd "secret-tool lookup mail-mbsync emysliwietz"
#Port 993
SSLType IMAPS
AuthMechs Login
CertificateFile /etc/ssl/certs/ca-certificates.crt

IMAPStore emysliwietz-remote
Account emysliwietz

MaildirStore emysliwietz-local
Path ~/mail/emysliwietz/
Inbox ~/mail/emysliwietz/INBOX
Subfolders Verbatim

Channel emysliwietz
Far :emysliwietz-remote:
Near :emysliwietz-local:
Create Both
Expunge Both
Sync All
Patterns *
SyncState *

###########################################
#+end_src
**** gmail
#+begin_src shell :tangle ~/.mbsyncrc
# ############################################
IMAPAccount gmail
Host imap.gmail.com
User e.p.mysliwietz@gmail.com
PassCmd "secret-tool lookup mail-mbsync gmail"
Port 993
SSLType IMAPS
AuthMechs Login
CertificateFile /etc/ssl/certs/ca-certificates.crt

IMAPStore gmail-remote
Account gmail

MaildirStore gmail-local
Path ~/mail/gmail/
Inbox ~/mail/gmail/INBOX
Subfolders Verbatim

Channel gmail
Far :gmail-remote:
Near :gmail-local:
Create Both
Expunge Both
Sync All
Patterns *
SyncState *

# ###########################################
#+end_src
**** mu init
#+begin_src shell :tangle no
mu init --maildir ~/mail --my-address="e.p.mysliwietz@gmail.com" --my-address="egidius@mysliwietz.de" --my-address="egidius.mysliwietz@gmx.de"
mu index
#+end_src
*** msmtprc - Sending mails
**** default settings
#+begin_src shell :tangle ~/.config/msmtp/config
defaults
auth	on
tls	on
tls_trust_file	/etc/ssl/certs/ca-certificates.crt
logfile /home/user/.config/msmtp/msmtp.log

#+end_src
**** gmail
#+begin_src shell :tangle ~/.config/msmtp/config
account gmail
host smtp.gmail.com
from e.p.mysliwietz@gmail.com
user e.p.mysliwietz@gmail.com
passwordeval "secret-tool lookup mail-mbsync gmail"

#+end_src

**** strato
#+begin_src shell :tangle ~/.config/msmtp/config
account emysliwietz
host smtp.strato.de
port 587
from egidius@mysliwietz.de
user egidius@mysliwietz.de
passwordeval "secret-tool lookup mail-mbsync emysliwietz"

#+end_src
**** ru
#+begin_src shell :tangle ~/.config/msmtp/config
account ru
host smtp.office365.com
port 587
auth xoauth2
from egidius.mysliwietz@ru.nl
user egidius.mysliwietz@ru.nl
passwordeval "secret-tool lookup mail-mbsync ru"

#+end_src

**** default account
#+begin_src shell :tangle ~/.config/msmtp/config
account default : emysliwietz
#+end_src
** Latex Tweaks
#+begin_src emacs-lisp
(load-module 'latex-tweaks)
#+end_src
*** Requirements
#+begin_src emacs-lisp :tangle packages.el

#+end_src
