config.org
*** Code
#+begin_src emacs-lisp :tangle modules/latex-tweaks.el
;;; latex.el -*- lexical-binding: t; -*-

(setq TeX-command-extra-options "--shell-escape")
(setq TeX-view-program-selection
      '((output-pdf "Zathura")
        (output-pdf "Evince")
        (output-pdf "PDF Tools")
        ((output-dvi has-no-display-manager)
         "dvi2tty")
        ((output-dvi style-pstricks)
         "dvips and gv")
        (output-dvi "xdvi")
        (output-html "xdg-open")
        (output-pdf "preview-pane")))

(setq TeX-engine 'luatex)
(add-hook 'org-mode-hook
          (lambda ()
            (local-set-key (kbd "<f6>")
                           (lambda () (interactive) (org-latex-export-to-pdf t)))))

(defun force-compile ()
  "Set the file modification times on the current file, then call
TeX-command-sequence.
This forces a complete recompilation of the document, even if the source
(.tex) is older than any existing outputs (.pdf etc)."
  (interactive)
  (set-buffer-modified-p t) ;; sets mod time to current time
  (save-buffer)
  (TeX-command-sequence t t))

(defun backup-copy-pdf-after-compilation (pdf-file)
  "Copy the newly created PDF file to the same directory as the source TeX file with a '.backup.pdf' suffix."
  (let ((source-directory (file-name-directory pdf-file))
        (pdf-file-name (file-name-nondirectory pdf-file))
        (backup-pdf-file (concat (file-name-sans-extension pdf-file) ".backup.pdf")))
        ;(message backup-pdf-file)
    (copy-file pdf-file (concat "" backup-pdf-file) t))) ;source-directory


; Create backup copy of pdf after successful compilation
; This way, you can read the pfd even while the new version is compiling
(add-hook 'TeX-after-compilation-finished-functions #'backup-copy-pdf-after-compilation)

(defun auto-async-export ()
  (let ((keywords (org-collect-keywords '("auto_async_export"))))
    (when (and keywords
               (eq major-mode 'org-mode)
               (string-equal "t" (pop (cdr (car keywords)))))
      (message "Exporting to pdf...")
      (org-latex-export-to-pdf t)
      (when (eq major-mode 'latex-mode)
        (force-compile))
      )
    )
  )

(defun org-after-save-cmd ()
  (interactive)
  (when (eq major-mode 'org-mode)
  (let ((cmd (cdr (car (org-collect-keywords '("on_save_cmd"))))))
        (when cmd
  (async-shell-command-no-window (pop cmd))))))
(setq password-cache t ; enable password caching
      password-cache-expiry 36000) ; for ten hours (time in secs)

(add-hook 'after-save-hook 'auto-async-export)
(add-hook 'after-save-hook 'org-after-save-cmd)
                                        ;(global-set-key [f6] (lambda () (interactive) (org-latex-export-to-pdf t)))
(setq org-latex-compiler "lualatex")
(setq-default TeX-master nil)
(add-to-list 'org-latex-packages-alist
             '("AUTO" "polyglossia" t ("xelatex" "lualatex")))

(defun latex-word-count ()
  "Return latex word count using texlive"
  (interactive)
  (let ((file-name (if (eq major-mode 'latex-mode)
                       (buffer-file-name)
                     (if (eq major-mode 'org-mode)
                         (file-name-with-extension (buffer-file-name) "tex")
                       (buffer-file-name)))))
  (message (shell-command-to-string (format "texcount -1 -merge -template={1} %s" file-name)))))

(add-hook 'TeX-language-en-hook
          (lambda () (ispell-change-dictionary "english")
            (setq TeX-quote-language `("german" "\\enquote{" "}" ,TeX-quote-after-quote))))

(add-hook 'TeX-language-de-hook
          (lambda () (ispell-change-dictionary "german")
            (setq TeX-quote-language `("german" "\\enquote{" "}" ,TeX-quote-after-quote))))


  ;; Latex classes
  (setq org-latex-subtitle-separate t
        org-latex-subtitle-format "\\subtitle{%s}")
  (setq org-latex-classes '(("article" "\\documentclass[a4wide,10pt]{article}"
                             ("\\section{%s}" . "\\section*{%s}")
                             ("\\subsection{%s}" . "\\subsection*{%s}")
                             ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                             ("\\paragraph{%s}" . "\\paragraph*{%s}")
                             ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))
                            ("report" "\\documentclass[11pt]{report}"
                             ("\\part{%s}" . "\\part*{%s}")
                             ("\\chapter{%s}" . "\\chapter*{%s}")
                             ("\\section{%s}" . "\\section*{%s}")
                             ("\\subsection{%s}" . "\\subsection*{%s}")
                             ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))
                            ("artikel" "\\documentclass[fancy, modern, twocolumn, titlepage=head, paper=a4, 12pt]{artikel}"
                             ("\\section{%s}" . "\\section*{%s}")
                             ("\\subsection{%s}" . "\\subsection*{%s}")
                             ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                             ("\\paragraph{%s}" . "\\paragraph*{%s}")
                             ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))
                            ("thesis" "\\documentclass[fancy, modern, twocolumn, titlepage=thesis, paper=a4, 12pt]{artikel}"
                             ("\\section{%s}" . "\\section*{%s}")
                             ("\\subsection{%s}" . "\\subsection*{%s}")
                             ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                             ("\\paragraph{%s}" . "\\paragraph*{%s}")
                             ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))
                            ("book" "\\documentclass[11pt]{book}"
                             ("\\part{%s}" . "\\part*{%s}")
                             ("\\chapter{%s}" . "\\chapter*{%s}")
                             ("\\section{%s}" . "\\section*{%s}")
                             ("\\subsection{%s}" . "\\subsection*{%s}")
                             ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))))

(setq org-export-headline-levels 5)

; Allow headlines, but not content, to not be exported (used for structuring org files)
(require 'ox-extra)
(ox-extras-activate '(ignore-headlines))

(setq deft-recursive t
      deft-use-filename-as-title t)
(let* ((base-dir "/home/user/dox/bib/")
        (bibfile (concat base-dir "bib.bib"))
        (notes-dir (concat base-dir "notes/"))
        (roam-notes-dir (concat org-roam-directory "/"))
        (lib-dir (concat base-dir "papers/")))
  (setq bibtex-completion-bibliography bibfile
        bibtex-completion-library-path `(,lib-dir)
        bibtex-completion-notes-path roam-notes-dir
        bibtex-completion-pdf-field "file"
        citar-bibliography `(,bibfile)
        citar-library-paths `(,lib-dir)
        citar-notes-paths `(,roam-notes-dir)
        deft-directory roam-notes-dir
        deft-default-extension "org"
        org-noter-notes-search-path `(,roam-notes-dir)
        org-cite-global-bibliography `(,bibfile)))

(setq bibtex-completion-notes-template-multiple-files
      (concat
       "#+TITLE: ${title}\n"
       "#+ROAM_KEY: cite:${=key=}\n"
       "* TODO Notes\n"
       ":PROPERTIES:\n"
       ":Custom_ID: ${=key=}\n"
       ":NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")\n"
       ":AUTHOR: ${author-abbrev}\n"
       ":JOURNAL: ${journaltitle}\n"
       ":DATE: ${date}\n"
       ":YEAR: ${year}\n"
       ":DOI: ${doi}\n"
       ":URL: ${url}\n"
       ":END:\n\n"
       ))


(setq org-export-with-sub-superscripts "{}"
      org-export-with-smart-quotes nil)

(after! latex
  (require 'engrave-faces)
  (engrave-faces-use-theme 'doom-one))

(setq org-preview-latex-process-alist
   '((dvipng :programs
      ("dvilualatex" "dvipng")
      :description "dvi > png" :message "you need to install the programs: dvilualatex and dvipng." :image-input-type "dvi" :image-output-type "png" :image-size-adjust
      (1.0 . 1.0
)
      :latex-compiler
      ("dvilualatex -interaction nonstopmode -output-directory %o %f")
      :image-converter
      ("dvipng -D %D -T tight -o %O %f")
      :transparent-image-converter
      ("dvipng -D %D -T tight -bg Transparent -o %O %f"))
     (dvisvgm :programs
      ("lualatex" "dvisvgm")
      :description "dvi > svg" :message "you need to install the programs: lualatex and dvisvgm." :image-input-type "dvi" :image-output-type "svg" :image-size-adjust
      (1.7 . 1.5)
      :latex-compiler
      ("lualatex -interaction nonstopmode -output-directory %o %f")
      :image-converter
      ("dvisvgm %f -n -b min -c %S -o %O"))
     (imagemagick :programs
      ("lualatex" "convert")
      :description "pdf > png" :message "you need to install the programs: lualatex and imagemagick." :image-input-type "pdf" :image-output-type "png" :image-size-adjust
      (1.0 . 1.0)
      :latex-compiler
      ("lualatex -interaction nonstopmode -output-directory %o %f")
      :image-converter
      ("convert -density %D -trim -antialias %f -quality 100 %O"))))

(provide 'latex-tweaks)
#+end_src
** PDF and Annotation Tweaks
#+begin_src emacs-lisp
(load-module 'pdf-and-annotation-tweaks)
#+end_src
*** Requirements
#+begin_src emacs-lisp :tangle packages.el
(package! org-noter)
#+end_src
*** Code
#+begin_src emacs-lisp :tangle modules/pdf-and-annotation-tweaks.el
(use-package! org-noter
  :after (:any org pdf-view)
  :config
  (setq
   ;; Please stop opening frames
   org-noter-always-create-frame nil
   org-noter-notes-window-location 'horizontal-split
   ;; I want to see the whole file
   org-noter-hide-other nil
   org-noter-auto-save-last-location t
   org-noter-suggest-from-attachments t
   org-noter-doc-split-percentage '(0.7 . 0.3)
   org-noter-doc-split-fraction '(0.7 . 0.3)
   )

  (defun org-noter-insert-short-note ()
    "Insert note and switch focus back to pdf."
    (interactive)
    (save-window-excursion
    (org-noter-insert-note)))

  (defun citar-noter-resume ()
    "Open notes to a document and resume editing"
    (interactive)
    (call-interactively 'citar-open-notes)
    (evil-goto-line)
    (org-noter)
    (pdf-view-noter-keymap-load))

  (defun pdf-view-high-contrast-theme ()
    "Sets black and white high contrast theme"
    (interactive)
    (pdf-view-themed-minor-mode -1)
    (setq old-pdf-view-midnight-colors pdf-view-midnight-colors)
    (setq pdf-view-midnight-colors '("#ffeeee" . "#000000"))
    (pdf-view-midnight-minor-mode 1))

  (defun pdf-view-undo-high-contrast-theme ()
    "Unsets black and white high contrast theme"
    (interactive)
    (pdf-view-themed-minor-mode -1)
    (setq pdf-view-midnight-colors old-pdf-view-midnight-colors)
    (pdf-view-midnight-minor-mode 1))



  (defun pdf-view-theme-cycle ()
    "Cycle between emacs, midnight and white theme"
    (interactive)
    (cond
     ((bound-and-true-p pdf-view-themed-minor-mode)
      (progn
        (pdf-view-themed-minor-mode -1)
        (pdf-view-midnight-minor-mode 1)))
     ((bound-and-true-p pdf-view-midnight-minor-mode)
      (progn
        (pdf-view-midnight-minor-mode -1)
        (pdf-view-themed-minor-mode -1)))
     (t (progn
          (pdf-view-midnight-minor-mode -1)
          (pdf-view-themed-minor-mode 1)
          )))))

(defun org-noter-new-heading ()
  "DOES NOT WORK: Copy the current heading and the next visible heading."
  (interactive)
  (org-noter--with-valid-session
  (let ((headline (completing-read "New chapter title: " nil))
        (page (format "%s" (org-noter--get-location-page (org-noter--doc-approx-location))))
        )
   (save-excursion
     (switch-to-buffer (org-noter--session-notes-buffer session))
    (save-excursion
      ;; Move up to the top-level heading
      (org-up-heading-all 10)
      (let ((start (point)))
        ;; Move to the next visible heading
        (org-next-visible-heading 1)
        (let ((end (point)))
          ;; Copy the region from start to end
          (kill-ring-save start end)
          )))
    (yank)
    (save-excursion
      (org-edit-headline headline)
      (org-set-property "NOTER_PAGE" page)
    )))))

(defun pdf-view-noter-keymap-load ()
  "Load org noter keymap for pdf-view"
  (interactive)
  (map! :after pdf-view
       :map pdf-view-mode-map
       :n "n" 'org-noter-insert-short-note
       :n "N" 'org-noter-insert-note
       :n "r" 'pdf-view-rotate
       :n "i" 'pdf-view-theme-cycle
       :n "I" 'pdf-view-high-contrast-theme
       :n "c" 'org-noter-new-heading
       :ne "<down-mouse-1>" 'ignore ; Because marking would reset rotation
       :n "+" 'pdf-view-enlarge
       :n "-" 'pdf-view-shrink))

(pdf-view-noter-keymap-load)

(setq pdf-view-resize-factor (/ 5 3.0))

(defun pdf-shrink ()
  "Shrink a pdf in pdf-view.
I'm not sure why pdf-view-resize-factor isn't consistent in both directions, so I need two seperate factors."
  (interactive)
  (pdf-view-enlarge 0.6))

(defun pdf-enlarge ()
  "Enlarge a pdf in pdf-view.
I'm not sure why pdf-view-resize-factor isn't consistent in both directions, so I need two seperate factors."
  (interactive)
  (pdf-view-enlarge 0.8))

(after! pdf-view
  (bind-key (kbd "C-s") 'pdf-occur pdf-view-mode-map)
  (bind-key (kbd "<C-mouse-4>") 'pdf-enlarge pdf-view-mode-map)
  (bind-key (kbd "<C-mouse-5>") 'pdf-shrink pdf-view-mode-map)

  (add-hook 'pdf-view-hook 'pdf-view-themed-minor-mode))

(provide 'pdf-and-annotation-tweaks)
#+end_src

** Tolino
#+begin_src emacs-lisp
(load-module 'tolino)
#+end_src
*** Requirements
#+begin_src emacs-lisp :tangle packages.el

#+end_src
*** Code
#+begin_src emacs-lisp :tangle modules/tolino.el

(setq tolino-dir "/home/user/dox/tolino/")

(defun citar-move-to-tolino (keys-entries &optional str)
  "Search pdfs."
  (interactive (list (citar-select-refs)))
  (let ((files (hash-table-to-value-list
                (citar-get-files
                 keys-entries))))
  (cl-map 'vector #'(lambda (f) (copy-file f tolino-dir 1 t)) files)))

(provide 'tolino)
#+end_src

** Secret Service Tweaks
#+begin_src emacs-lisp
(load-module 'secret-service-tweaks)
#+end_src
*** Requirements
#+begin_src emacs-lisp :tangle packages.el

#+end_src
