config.org
*** Code
#+begin_src emacs-lisp :tangle modules/secret-service-tweaks.el
  ;; Load and patch secrets
  (use-package! secrets
    :commands (secrets-search-items
               secrets-get-secret
               secrets-get-attributes)
    :config
    ;; Adds a patch to fix behavior with KeepassXC
    (defun secrets-unlock-item (collection item)
      "Unlock item labeled ITEM from collection labeled COLLECTION.
    If successful, return the object path of the item."
      (let ((item-path (secrets-item-path collection item)))
        (unless (secrets-empty-path item-path)
          (secrets-prompt
           (cadr
            (dbus-call-method
             :session secrets-service secrets-path secrets-interface-service
             "Unlock" `(:array :object-path ,item-path)))))
        item-path))

    ;; Adds a patch to fix behavior with KeepassXC
    (defun secrets-get-secret (collection item)
      "Return the secret of item labeled ITEM in COLLECTION.
    If there are several items labeled ITEM, it is undefined which
    one is returned.  If there is no such item, return nil.

    ITEM can also be an object path, which is used if contained in COLLECTION."
      (let ((item-path (secrets-unlock-item collection item)))
        (unless (secrets-empty-path item-path)
          (dbus-byte-array-to-string
           (nth 2
                (dbus-call-method
                 :session secrets-service item-path secrets-interface-item
                 "GetSecret" :object-path secrets-session-path)))))))

(require 'async)
(defun secrets-get-secret-async (db-name password-name variable)
  (async-start
   ; Async function
   `(lambda ()
      (require 'secrets)
      (secrets-get-secret ,db-name ,password-name)
      )

   ; Callback
   `(lambda (result)
      (setq ,variable result)))
  )


(provide 'secret-service-tweaks)
#+end_src
** AI Assistants
*** Chat GPT
No longer useful because of API limits
#+begin_src emacs-lisp
(load-module 'chat-gpt)
#+end_src
**** Requirements
#+begin_src emacs-lisp :tangle packages.el
(package! gptel :recipe (:host github :repo "karthink/gptel"))
#+end_src
**** Code
#+begin_src emacs-lisp :tangle modules/chat-gpt.el
(use-package! gptel
  :defer t
  :config
    (secrets-get-secret-async "Passwords" "ChatGPT API Key" 'gptel-api-key)
    (setq gptel--system-message "")
  )
(provide 'chat-gpt)
#+end_src
*** AI Chat (Bing and ChatGPT)
#+begin_src emacs-lisp
(load-module 'ai-assistant)
#+end_src
**** Requirements
#+begin_src emacs-lisp :tangle packages.el
(package! async-await)
(package! aichat :recipe (:host github :repo "xhcoding/emacs-aichat"))
#+end_src
**** Code
#+begin_src emacs-lisp :tangle modules/ai-assistant.el
(load-module 'async-await)
(setq markdown-fontify-code-blocks-natively t)
(provide 'ai-assistant)
#+end_src
** Calendar Tweaks
#+begin_src emacs-lisp
(load-module 'calendar-tweaks)
#+end_src
*** Requirements
#+begin_src emacs-lisp :tangle packages.el

#+end_src
*** Code
#+begin_src emacs-lisp :tangle modules/calendar-tweaks.el
;; deutsche Feiertage
;; Show holidays in Org Agenda
(setq org-agenda-include-diary t)

(setq calendar-week-start-day 1
      calendar-time-display-form '(24-hours ":" minutes)
      calendar-date-style 'european
      calendar-day-name-array ["Sonntag" "Montag" "Dienstag" "Mittwoch"
                               "Donnerstag" "Freitag" "Samstag"]
      calendar-month-name-array ["Januar" "Februar" "März" "April" "Mai"
                                 "Juni" "Juli" "August" "September"
                                 "Oktober" "November" "Dezember"])

(setq solar-n-hemi-seasons
      '("Frühlingsanfang" "Sommeranfang" "Herbstanfang" "Winteranfang"))


(setq holiday-german-general-holidays
      '((holiday-fixed 1 1 "Neujahr")
        (holiday-fixed 5 1 "1. Mai")
        (holiday-fixed 10 3 "Tag der Deutschen Einheit")))

(setq holiday-german-christian-holidays
      '((holiday-float 12 0 -4 "1. Advent" 24)
        (holiday-float 12 0 -3 "2. Advent" 24)
        (holiday-float 12 0 -2 "3. Advent" 24)
        (holiday-float 12 0 -1 "4. Advent" 24)
        (holiday-fixed 12 25 "1. Weihnachtstag")
        (holiday-fixed 12 26 "2. Weihnachtstag")
        (holiday-fixed 1 6 "Heilige Drei Könige")
        (holiday-easter-etc -48 "Rosenmontag")
        (holiday-easter-etc -3 "Gründonnerstag")
        (holiday-easter-etc  -2 "Karfreitag")
        (holiday-easter-etc   0 "Ostersonntag")
        (holiday-easter-etc  +1 "Ostermontag")
        (holiday-easter-etc +39 "Christi Himmelfahrt")
        (holiday-easter-etc +49 "Pfingstsonntag")
        (holiday-easter-etc +50 "Pfingstmontag")
        (holiday-easter-etc +60 "Fronleichnam")
        (holiday-fixed 8 15 "Mariæ Himmelfahrt")
        (holiday-fixed 11 1 "Allerheiligen")
        (holiday-fixed 11 2 "Allerseelen")
        (holiday-float 11 3 1 "Buß- und Bettag" 16)
        (holiday-float 11 0 1 "Totensonntag" 20)))

(setq holiday-filipino-general-holidays
      '((holiday-fixed 1 23 "1st Philippine Republic Day")
        (holiday-fixed 4 9 "Araw ng Kagitingan")
        (holiday-fixed 6 12 "Filipino Independence Day")
        (holiday-fixed 8 21 "Ninoy Aquino Day")
        (holiday-fixed 9 3 "Surrender of Tomoyuki Yamashita")
        (holiday-float 8 1 -1 "National Heros of the Philippines")
        (holiday-fixed 12 30 "Jose Rizal Day")))

(setq holiday-filipino-christian-holidays
      '((holiday-fixed 9 8 "Feast of the Nativity of Mary")
        (holiday-fixed 11 30 "Bonifacio Day")))

(setq holiday-us-elections
      '((holiday-sexp
       '(if (zerop (% year 4))
           (calendar-gregorian-from-absolute
             (1+ (calendar-dayname-on-or-before
                   1 (+ 6 (calendar-absolute-from-gregorian
                            (list 11 1 year)))))))
       "US Presidential Election")
))

(setq calendar-christian-all-holidays-flag t
      calendar-islamic-all-holidays-flag t)

(setq calendar-holidays
      (append holiday-general-holidays holiday-local-holidays holiday-other-holidays
	      holiday-solar-holidays holiday-christian-holidays holiday-german-general-holidays holiday-german-christian-holidays holiday-us-elections holiday-hebrew-holidays holiday-islamic-holidays holiday-oriental-holidays holiday-filipino-general-holidays holiday-filipino-christian-holidays))

(defun =calendar-no-evil ()
  (interactive)
  (=calendar)
  (evil-local-mode nil))

(global-set-key (kbd "s-c") '=calendar-no-evil)

(provide 'calendar-tweaks)
#+end_src

*** Org GCal tweaks
#+begin_src emacs-lisp
(load-module 'org-g-cal-tweaks)
#+end_src
**** Requirements
#+begin_src emacs-lisp :tangle packages.el
(package! org-gcal)
(package! request)
(package! alert)
(package! persist)
(package! aio)
(package! oauth2-auto)
#+end_src
**** Code
#+begin_src emacs-lisp :tangle modules/org-g-cal-tweaks.el
(require 'async)

(async-start
 (lambda ()
   (require 'secrets)
   (let ((cal1 (secrets-get-secret "Passwords" "Org GCal Calendar 1"))
         (cal2 (secrets-get-secret "Passwords" "Org GCal Calendar 2")))
     `(
       (,cal1 .  "~/sync/agenda/gcal.org")
       (,cal2 .  "~/sync/agenda/gcal.org")
       )))
 (lambda (result)
   (setq org-gcal-fetch-file-alist result)))

(setq org-gcal-notify-p t
      plstore-cache-passphrase-for-symmetric-encryption t)


(async-start
 (lambda ()
   (require 'secrets)
   `(,(secrets-get-secret "Passwords" "Org GCal Client ID")
     ,(secrets-get-secret "Passwords" "Org GCal Client Secret"))
   )
 (lambda (result)
   (let ((id (nth 0 result))
         (sc (nth 1 result))
         )
     (setq org-gcal-client-id id
           org-gcal-client-secret sc)
     (org-gcal-reload-client-id-secret)
     (require 'oauth2-auto)
     (require 'plstore)
     (require 'org-gcal)
     )))

(provide 'org-g-cal-tweaks)
#+end_src
** Thinkpad Tweaks
#+begin_src emacs-lisp
;(load-module 'thinkpad-tweaks)
#+end_src
*** Requirements
#+begin_src emacs-lisp :tangle packages.el

#+end_src
*** /etc/systemd/system/battery-threshold.service
#+begin_src conf :tangle no
[Unit]
Description=Set battery charge control start and end thresholds

[Service]
Type=oneshot
ExecStart=/bin/bash -c '[ -d /sys/class/power_supply/BAT0 ] && echo 40 > /sys/class/power_supply/BAT0/charge_control_start_threshold'
ExecStart=/bin/bash -c '[ -d /sys/class/power_supply/BAT0 ] && echo 60 > /sys/class/power_supply/BAT0/charge_control_end_threshold'
ExecStart=/bin/bash -c '[ -d /sys/class/power_supply/BAT1 ] && echo 40 > /sys/class/power_supply/BAT1/charge_control_start_threshold'
ExecStart=/bin/bash -c '[ -d /sys/class/power_supply/BAT1 ] && echo 60 > /sys/class/power_supply/BAT1/charge_control_end_threshold'
User=root
#+end_src
*** /etc/systemd/system/battery-threshold.timer
#+begin_src conf :tangle no
[Unit]
Description=Run battery-threshold at startup

[Timer]
OnStartupSec=5min

[Install]
WantedBy=timers.target
#+end_src

*** Full Battery script
Charges battery to 100% full by undoing service, active until restart
#+begin_src shell :tangle ~/.scripts/battery-full.sh
#!/bin/env sh
# Undoes battery-threshold.service and charges battery to 100% until restart
# Run as root

/bin/bash -c '[ -d /sys/class/power_supply/BAT0 ] && echo 0 > /sys/class/power_supply/BAT0/charge_control_start_threshold'
/bin/bash -c '[ -d /sys/class/power_supply/BAT0 ] && echo 100 > /sys/class/power_supply/BAT0/charge_control_end_threshold'
/bin/bash -c '[ -d /sys/class/power_supply/BAT1 ] && echo 0 > /sys/class/power_supply/BAT1/charge_control_start_threshold'
/bin/bash -c '[ -d /sys/class/power_supply/BAT1 ] && echo 100 > /sys/class/power_supply/BAT1/charge_control_end_threshold'
#+end_src

** Nano Tweaks
#+begin_src emacs-lisp
;(load-module 'nano-tweaks)
#+end_src
*** Requirements
#+begin_src emacs-lisp :tangle packages.el
(package! nano :recipe (:host github :repo "rougier/nano-emacs"))
;(package! nano-theme :recipe (:host github :repo "rougier/nano-theme"))
(package! mu4e-dashboard :recipe (:host github :repo "rougier/mu4e-dashboard"))
(package! svg-tag-mode)
(package! ts)
(package! nano-sidebar :recipe (:host github :repo "rougier/nano-sidebar"))
#+end_src
