packages.el





(package! gptel :recipe (:host github :repo "karthink/gptel"))

(package! async-await)
(package! aichat :recipe (:host github :repo "xhcoding/emacs-aichat"))



(package! org-gcal)
(package! request)
(package! alert)
(package! persist)
(package! aio)
(package! oauth2-auto)



(package! nano :recipe (:host github :repo "rougier/nano-emacs"))
;(package! nano-theme :recipe (:host github :repo "rougier/nano-theme"))
(package! mu4e-dashboard :recipe (:host github :repo "rougier/mu4e-dashboard"))
(package! svg-tag-mode)
(package! ts)
(package! nano-sidebar :recipe (:host github :repo "rougier/nano-sidebar"))

(package! eee
      :recipe
      (:host github
