packages.el
       :repo "eval-exec/eee.el"
       :files (:defaults "*.el" "*.sh")))
