config.org
*** Code
#+begin_src emacs-lisp :tangle modules/bible.el
;;; bible.el -*- lexical-binding: t; -*-

(defun bible-books-long (binary)
  "Return list of books of the Bible"
  (split-string-and-unquote (shell-command-to-string (format "%s -l | awk 'NF{NF--}; 1' | sed '1s/^\xEF\xBB\xBF//'" binary)) "\n"))

(defun bible-books-short (binary)
  "Return list of abbreviated books of the Bible"
  (split-string-and-unquote (shell-command-to-string (format "%s -l | awk '{print $(NF)}' | sed 's/^\(//;s/\)$//;1s/^\xEF\xBB\xBF//'" binary)) "\n"))

(defun bible-text (binary book-chapter-and-verse)
  "Return text of Bible binary at specified book, chapter and verse"
  (let* ((bcv1 (string-replace "." "" book-chapter-and-verse))
         (bcv (string-replace "," ":" bcv1)))
    (shell-command-to-string (format "%s %s | sed 's/\r//g'" binary (replace-regexp-in-string "\n" "" bcv)))))

(setq bible-minor-mode--last-book ""
      bible-minor-mode--last-chapter-and-verse "")

(defun bible-select-internal (binary)
  "Ask user to select bible verse using kjv-like binary"
  (let* ((book (ivy-read "Select Book: " (bible-books-long binary) :preselect bible-minor-mode--last-book))
         (chapter-and-verse (ivy-read (format "Choose Chapter and Verse of %s: " book) '() :initial-input bible-minor-mode--last-chapter-and-verse)))
    (setq bible-minor-mode--last-book book
          bible-minor-mode--last-chapter-and-verse chapter-and-verse)
    `(,book ,chapter-and-verse)))


(defun bible-select (binary)
  "Ask user to select bible verse using kjv-like binary"
 (let* ((pair (bible-select-internal binary))
       (book (car pair))
       (chapter-and-verse (car (cdr pair)))
       )
    (format "%s %s" book chapter-and-verse)))



(defun bible-insert (&optional verse)
  "Inserts text of the Bible of selected verse"
  (interactive)
  (if verse
      (insert (bible-text (bible-minor-mode--default-bible-binary) verse))
    (insert (bible-text (bible-minor-mode--default-bible-binary) (bible-select (bible-minor-mode--default-bible-binary))))))

(defun bible-buffer-update (verse)
  "Updates the Bible buffer with verse"
  (switch-to-buffer "*Bible*")
  (erase-buffer)
  (bible-insert verse)
  (bible-mode))

(defun bible ()
  "Open the Bible at selected verse"
  (interactive)
  (let ((bible-verse (bible-select (bible-minor-mode--default-bible-binary))))
    (bible-buffer-update bible-verse)
    (goto-char 0)))

(defun kjv ()
  "Insert Bible Verse from the King James Version"
  (interactive)
  (let ((bin "kjv"))
    (insert (bible-text bin (bible-select bin)))))

(defun menge ()
  "Insert Bible Verse from the Menge Bible"
  (interactive)
  (let ((bin "menge"))
    (insert (bible-text bin (bible-select bin)))))

(defun vul ()
  "Insert Bible Verse from the Vulgate"
  (interactive)
  (let ((bin "vul"))
    (insert (bible-text bin (bible-select bin)))))

(defun sxx ()
  "Insert Bible Verse from the Septuagint"
  (interactive)
  (let ((bin "grb"))
    (insert (bible-text bin (bible-select bin)))))

(defun grb ()
  "Insert Bible Verse from the Septuagint"
  (interactive)
  (sxx))

(setq bible-minor-mode--bible-binary-list '("menge" "kjv" "vul" "grb"))

(defun bible-minor-mode--default-bible-binary ()
  "Default bible binary to use"
  (car bible-minor-mode--bible-binary-list))

(defun set-bible-version ()
  "Change the version of the bible"
  (interactive)
  (let ((s
         (ivy-read "Select bible version: " bible-minor-mode--bible-binary-list :require-match t :preselect (bible-minor-mode--default-bible-binary))))
    (setq bible-minor-mode--bible-binary-list (append `(,s) (delete s bible-minor-mode--bible-binary-list)))
    (message (bible-minor-mode--default-bible-binary))))

(defun cycle-bible-version ()
  (setq bible-minor-mode--bible-binary-list (append (cdr-safe bible-minor-mode--bible-binary-list) `(,(car bible-minor-mode--bible-binary-list)))))

;;; Bible Mode

(defun bible-mode--cycle-version ()
  "Cycles Bible Version used for currently displayed text"
  (cycle-bible-version)
  (let ((v (bible-mode--current-verse)))
    (message (format "-> %s" v))
    (bible-buffer-update (format "%s %s" bible-minor-mode--last-book
                                 bible-minor-mode--last-chapter-and-verse))
    (bible-mode--goto-verse v)))

(defun bible-mode--current-verse ()
  "Current Verse at point"
  (message
   (save-excursion
     (car (s-split-up-to "\t" (thing-at-point 'line) 1))
     )))

(defun bible-mode--goto-verse (verse)
  (goto-char 0)
  (search-forward verse))

(define-derived-mode bible-mode text-mode (bible-minor-mode--default-bible-binary) "Major mode for reading the Bible.")

(map! :map bible-mode-map
      :n "x" #'bible-mode--cycle-version)

;;; Bible Minor Mode
(defun bible-tooltip (window object pos)
  (let ((verse (bible-mode--current-verse)))
    (tooltip-mode 1)
    (setq bible-minor-mode--last-verse verse)
    (let ((bible-verse (bible-text (bible-minor-mode--default-bible-binary) verse)))
                                        ;(message bible-verse)
      (if (> (length bible-verse) 2000)
          (substring bible-verse 0 2000)
        bible-verse))
    ))

(defun bible-show-verse ()
  "Shows tooltip for verse at point"
  (interactive)
  (setq bible-minor-mode--last-verse nil)
  (tooltip-show (bible-tooltip nil nil (point))))

(defun bible-minor-mode-highlight ()
  "Highlight bible verses"
  (font-lock-add-keywords nil `((,bible-minor-mode--bible-verse-regex 0 '(face font-lock-keyword-face help-echo bible-tooltip))))
  (font-lock-flush))

(defun bible-minor-mode-revert ()
  "Undo highlight bible verses"
  (font-lock-remove-keywords nil `((,bible-minor-mode--bible-verse-regex 0 '(face font-lock-keyword-face help-echo bible-tooltip))))
  (font-lock-flush))

;;;###autoload
(define-minor-mode bible-minor-mode
  "Highlight bible verses and provide tooltips for them"
  :lighter " ✝"
  :global nil
  (if bible-minor-mode
      (bible-minor-mode-highlight)
    (bible-minor-mode-revert)))

(add-hook 'org-mode-hook 'bible-minor-mode)

(setq bible-books-short-manual-additions '("Gen"))

(defun bible-books-regex ()
  "Combines all bible books into a partial regex"
  (string-join (append (bible-books-short "kjv")
                       (bible-books-long "kjv")
                       (bible-books-short "menge")
                       (bible-books-long "menge")
                       bible-books-short-manual-additions)
               "\\|"))


"Creates a regex for verses of all bible books"
(when (not (boundp 'bible-minor-mode--bible-verse-regex))
  (setq bible-minor-mode--bible-verse-regex
        (format
         "\\(%s\\) \\([[:digit:]]+\\(\\(\\:\\|\\,\\)[[:digit:]]+\\)?\\)\\(-[[:digit:]]+\\(\\(\\:\\|\\,\\)[[:digit:]]+\\)?\\)?"
         (bible-books-regex))))
                                        ;bible-minor-mode--bible-verse-regex)

(provide 'bible)
#+end_src
*** org-link-bible
#+begin_src emacs-lisp
(load-module 'ol-bible)
#+end_src
*** Requirements
#+begin_src emacs-lisp :tangle packages.el

#+end_src
*** Code
#+begin_src emacs-lisp :tangle modules/ol-bible.el
                                        ; Implements a link to a bible section or verse
                                        ; [[bible:Gen ̄1:1][Genesis 1:1]]
(load-module 'bible)
(load-module 'ol)

(org-link-set-parameters "bible"
                         :follow #'org-bible-open
                         :export #'org-bible-export
                         :store #'org-bible-store-link)


(define-derived-mode bible-view-mode org-mode "Bible View"
  "A mode to view the bible in.")

(map! :map bible-view-mode-map
      :nvi "ö" #'bible-view-cycle-language
      :nvi "x" #'bible-view-cycle-language)

(defun bible-view-cycle-language ()
  "Cycle the language in a bible view buffer."
  (interactive)
  (cycle-bible-version)
  (erase-buffer)
  (bible-insert (org-bible-get-chapter-verse)))



(defun org-bible-open (chapter-verse _)
  "Visit the bible page on CHAPTER-VERSE."
  (let ((buf (get-buffer-create (format "*Bible: %s*" chapter-verse))))
    (with-current-buffer buf
      (erase-buffer)
      (bible-view-mode)
      (bible-insert chapter-verse)
                                        ;(bible-mode 1)
      )
    (display-buffer buf '((display-buffer-pop-up-window))))
  )

;; (defun org-man-store-link (&optional _interactive?)
;;   "Store a link to a bible page."
;;   (when (memq major-mode '(bible-mode))
;;     ;; This is a man page, we do make this link.
;;     (let* ((page (org-man-get-page-name))
;;            (link (concat "man:" page))
;;            (description (format "Man page for %s" page)))
;;       (org-link-store-props
;;        :type "man"
;;        :link link
;;        :description description))))

(defun org-bible-get-chapter-verse ()
  "Extract the bible chapter and verse from the buffer name."
  ;; This works for `bible-view-mode'.
  (if
      (string-match "\\*Bible: \\(.*\\)\\*" (buffer-name))
      (match-string 1 (buffer-name))
    (error "Cannot find bible chapter"))
  )

(defun org-bible-export (link description format _)
  "Export a bible link from Org files."
  (let ((path (format "http://man.he.net/?topic=%s&section=all" link))
        (desc (or description link)))
    (pcase format
      (`html (format "<a target=\"_blank\" href=\"%s\">%s</a>" path desc))
      (`latex (format "\\href{%s}{%s}" path desc))
      (`texinfo (format "@uref{%s,%s}" path desc))
      (`ascii (format "%s (%s)" desc path))
      (_ path))))

(defun get-corresponding-element (element list1 list2)
  "Return the corresponding element in LIST2 for ELEMENT in LIST1."
  (let ((index (cl-position element list1 :test 'equal)))  ; Find the index of ELEMENT in LIST1
    (if index
        (nth index list2)  ; Return the corresponding element from LIST2
      nil)))  ; Return nil if ELEMENT is not found



(defun org-bible-insert ()
  "Insert a link to a bible chapter and verse."
  (interactive)

  (let* ((bb (bible-minor-mode--default-bible-binary))
         (pair (bible-select-internal bb))
         (book-long (car pair))
         (cv (car (cdr pair)))
         (book-short (get-corresponding-element book-long (bible-books-long bb) (bible-books-short bb))))
    (insert (format "[[bible:%s %s][%s %s]]" book-short cv book-long cv))))

(provide 'ol-bible)
#+end_src
** Workarounds
#+begin_src emacs-lisp
(load-module 'workarounds)
#+end_src
*** Requirements
#+begin_src emacs-lisp :tangle packages.el
; Temporary workaround, remove at emacs 29
(package! transient
      :recipe (:host github :repo "magit/transient"))

(package! with-editor
          :recipe (:host github :repo "magit/with-editor"))

(unpin! magit)

(package! diff-hl :disable t)
#+end_src
*** Code
#+begin_src emacs-lisp :tangle modules/workarounds.el
;(global-diff-hl-mode -1)
;(remove-hook 'dired-mode-hook '+vc-gutter-enable-maybe-h)
(provide 'workarounds)
#+end_src
