packages.el

; Temporary workaround, remove at emacs 29
(package! transient
      :recipe (:host github :repo "magit/transient"))

(package! with-editor
          :recipe (:host github :repo "magit/with-editor"))

(unpin! magit)

(package! diff-hl :disable t)
